Repository: yamarten/atproto-website
Catalog: translation/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: There are a few new concepts here. You'll recognize the `app.bsky.feed.post` logic, and now you'll also implement `app.bsky.notification.listNotifications` and `app.bsky.feed.getPostThread`. The first Lexicon is used to get a list of notifications for, and the second fetches the full thread for a given post URI.
ja: ここではいくつか新しい概念が出てきます。`app.bsky.feed.post`のロジックは見覚えがあるはずですが、ここではさらに`app.bsky.notification.listNotifications`と`app.bsky.feed.getPostThread`も使用します。前者は通知一覧の取得に使い、後者は指定した投稿URIのスレッド全体を取得するために使います。

source: There are a few things to note here. You've supplied a `DEFAULT_REPO` to fetch with `tap`. In this case, you're following a single user, [`pfrazee.com`](https://bsky.app/profile/pfrazee.com). This will keep the tutorial example manageable.
ja: いくつか注目すべき点があります。`tap`で取得する対象として`DEFAULT_REPO`を指定しています。この例では一人のユーザーとして[`pfrazee.com`](https://bsky.app/profile/pfrazee.com)を追跡します。これにより、チュートリアルの例を扱いやすくしています。

source: There are also community-maintained implementations in [Python](https://github.com/MarshalX/bluesky-feed-generator) and [Ruby](https://github.com/mackuba/bluesky-feeds-rb)
ja: [Python](https://github.com/MarshalX/bluesky-feed-generator)と[Ruby](https://github.com/mackuba/bluesky-feeds-rb)でコミュニティによる実装もあります

source: There are also community-maintained implementations in [Python](https://github.com/MarshalX/bluesky-feed-generator) and [Ruby](https://github.com/mackuba/bluesky-feeds-rb).
ja: [Python](https://github.com/MarshalX/bluesky-feed-generator)と[Ruby](https://github.com/mackuba/bluesky-feeds-rb)でコミュニティによる実装もあります。

source: There are also several community PDS implementations! For example: - [Tranquil PDS](https://tangled.org/lewis.moe/bspds-sandbox), written in Rust. - [Cocoon](https://tangled.org/hailey.at/cocoon), written in Go.
ja: コミュニティによるPDS実装もあります。例えば、以下があります。 - [Tranquil PDS](https://tangled.org/lewis.moe/bspds-sandbox)（Rust） - [Cocoon](https://tangled.org/hailey.at/cocoon)（Go）

source: There are client-side code samples for both methods here:
ja: 以下に両方の方法のクライアント側のコードサンプルがあります。

source: There are different kinds of services which you can [self-host](/guides/self-hosting):
ja: [セルフホスト](/guides/self-hosting)できるサービスには、いくつかの種類があります。

source: There are lots of other decisions that will go into designing and running your own Atmosphere apps! This will not be a comprehensive list of recommendations.
ja: Atmosphereアプリを設計・運用する際には他にも多くの判断事項があります。このガイドは推奨事項の包括的なリストではありません。

source: There are many ways of synchronizing and streaming AT data. You can use [Jetstream](/guides/streaming-data) to stream real-time updates, or locally [Backfill](/guides/backfilling) the data that already exists on the network.
ja: ATデータを同期およびストリーミングする方法は多数あります。[Jetstream](/guides/streaming-data)を使ってリアルタイムの更新をストリーミングしたり、ネットワーク上に既に存在するデータをローカルに[バックフィル](/guides/backfilling)したりできます。

source: There are other definition attributes, but they are only used by the global label values.
ja: 他にも定義属性がありますが、グローバルラベル値にのみ使用されます。

source: There are several design strategies that can be used to "upgrade" a public client into a confidential client:
ja: パブリッククライアントを機密クライアントにアップグレードするために使用できるいくつかの設計手法があります。

source: There are two reasons global label values exist.
ja: グローバルラベル値が存在する理由は2つあります。

source: There can be an ecosystem of App Views for each lexicon deployed on the network. For example, *Bluesky* currently supports a micro-blogging mode: the `app.bsky` Lexicon. Developers who create new lexicons could deploy a corresponding App View that understands their Lexicon to service their users. Other lexicons could include [video](https://stream.place/), or [long-form blogging](https://leaflet.pub/), or [collaborative coding](https://tangled.org/). By bootstrapping off of an existing Relay, data collation will already be taken care of for these new applications. They can benefit from the critical mass of users already posting on Bluesky and populating their repositories with other Lexicons; they only need to provide the indexing behaviors necessary for their application.
ja: ネットワークに展開された各Lexiconごとに、AppViewのエコシステムが存在し得ます。例えば、*Bluesky*は現在マイクロブログの側面、つまり`app.bsky` Lexiconをサポートしています。新しいLexiconを作成する開発者は、ユーザーに提供するために、そのLexiconを理解するAppViewをデプロイできます。他のLexiconの例としては、[動画](https://stream.place/)や[長文ブログ](https://leaflet.pub/)や[共同コーディング](https://tangled.org/)などが挙げられます。既存のリレーでブートストラップすることで、新しいアプリケーションのためのデータ収集が行われている状態から始められます。これにより、Blueskyに投稿し、他のLexiconでリポジトリを使っているクリティカルマスの既存ユーザーから恩恵を受けることができます。必要なのは、自分のアプリケーションに必要なインデックス処理を提供することだけです。

source: There is a Typescript library for working with Tap at [@atproto/tap](https://www.npmjs.com/package/@atproto/tap).
ja: Tapを扱うためのTypescriptライブラリは[@atproto/tap](https://www.npmjs.com/package/@atproto/tap)にあります。

source: There is a basic convention for pagination of `query` API endpoints:
ja: `query` APIエンドポイントのページネーションの基本的な慣例

source: There is a limit to how often you can change your birthdate. You may need to wait a day or two before updating it again.
ja: 生年月日を変更できる頻度に制限があります。再度更新する前に1日か2日待つ必要があるかもしれません。

source: There is also a convention for subscription endpoints which support “sequencing” and backfill cursors:
ja: 「シーケンシング」とバックフィルカーソルをサポートするサブスクリプションエンドポイントの慣例

source: There is no time limit for account deactivation, come back any time.
ja: アカウントの無効化に期限はありません。いつでも戻ってこられます。

source: There was a problem with your internet connection, please try again
ja: インターネット接続に問題が発生しました。もう一度やり直してください

source: There was an issue connecting to Tenor.
ja: Tenorへの接続中に問題が発生しました。

source: There was an issue contacting the server
ja: サーバーへの問い合わせ中に問題が発生しました

source: There was an issue contacting the server, please check your internet connection and try again.
ja: サーバーへの問い合わせ中に問題が発生したので、インターネットへの接続を確認の上、もう一度試してください。

source: There was an issue fetching notifications. Tap here to try again.
ja: 通知の取得中に問題が発生しました。もう一度試すにはこちらをタップしてください。

source: There was an issue fetching posts. Tap here to try again.
ja: 投稿の取得中に問題が発生しました。もう一度試すにはこちらをタップしてください。

source: There was an issue fetching the list. Tap here to try again.
ja: リストの取得中に問題が発生しました。もう一度試すにはこちらをタップしてください。

source: There was an issue fetching your app passwords
ja: アプリパスワードの取得中に問題が発生しました

source: There was an issue fetching your lists. Tap here to try again.
ja: リストの取得中に問題が発生しました。もう一度試すにはこちらをタップしてください。

source: There was an issue fetching your service info
ja: サービス情報の取得中に問題が発生しました

source: There was an issue removing this feed. Please check your internet connection and try again.
ja: フィードの削除中に問題が発生しました。インターネットへの接続を確認の上、もう一度試してください。

source: There was an issue updating your feeds, please check your internet connection and try again.
ja: フィードの更新中に問題が発生したので、インターネットへの接続を確認の上、もう一度試してください。

source: There was an issue! {0}
ja: 問題が発生しました！ {0}

source: There was an issue. Please check your internet connection and try again.
ja: 問題が発生しました。インターネットへの接続を確認の上、もう一度お試しください。

source: There was an unexpected issue in the application. Please let us know if this happened to you!
ja: アプリケーションに予期しない問題が発生しました。このようなことが繰り返した場合はサポートへお知らせください！

source: There's been a rush of new users to Bluesky! We'll activate your account as soon as we can.
ja: Blueskyに新規ユーザーが殺到しています！できるだけ早くアカウントを有効にできるよう努めます。

source: These are your default settings
ja: これらはデフォルトの設定です

source: These settings only apply to the Following feed.
ja: これらの設定はFollowingフィードにのみ適用されます。

source: These simple example apps demonstrate usage of their respective SDKs.
ja: これらのシンプルなサンプルアプリは、各SDKの使用方法を示しています。

source: These tutorials will guide you through building applications using the AT Protocol. Each tutorial focuses on a specific use case or feature, providing step-by-step instructions and code examples.
ja: このチュートリアルでは、ATプロトコルを使ったアプリケーション開発を順を追って学べます。各チュートリアルは個別のユースケースや機能に焦点を当て、段階を踏んだ手順とコード例を提供します。

source: They are described in more depth in the [Repository specification](/specs/repository).
ja: [リポジトリ仕様](/specs/repository)で詳細に説明されています。

source: Think of our app like a Google. If Google's job was to say which emoji each website had under `/status.json`, then it would show something like:
ja: 私たちのアプリをGoogleのようなものだと考えてください。Googleの仕事が、各ウェブサイトの`/status.json`の下にどの絵文字があるかを伝えることだったとしたら、次のような表示になります。

source: This OAuth tutorial does not use many Atproto concepts or dependencies. You should have a working understanding of Next.js and TypeScript.
ja: このOAuthチュートリアルではatprotoの概念や依存関係をあまり使いません。Next.jsとTypeScriptの実用的な理解があることを前提とします。

source: This `data` object could then be referenced in another record, e.g. as an `embed`.
ja: この`data`オブジェクトは別のレコードで参照できます。例えば`embed`として使用できます。

source: This account has a checkmark because it's been verified by trusted sources.
ja: 信頼できるソースによって認証されたため、このアカウントにはチェックマークが付いています。

source: This account has one or more attempted verifications, but it is not currently verified.
ja: このアカウントは認証は何度か認証が試みられましたが、現在は認証されていません。

source: This account has requested that users sign in to view their profile.
ja: このアカウントを閲覧するためにはサインインが必要です。

source: This account is blocked by one or more of your moderation lists. To unblock, please visit the lists directly and remove this user.
ja: このアカウントは1つ、あるいは複数のモデレーションリストでブロックされています。ブロックを解除するにはリストの画面に移動してこのユーザーをリストから外してください。

source: This action can be undone at any time.
ja: この操作はいつでも元に戻すことができます。

source: This allows your rate limiting to scale gracefully.
ja: これにより、レート制限を段階的にスケールできます。

source: This also means that all the POST requests you make to an Atproto app are retained and can be streamed back in that same format. This saves developers from having to make many backend implementation decisions. It also means that new applications that build on the AT Protocol can leverage existing social graph data — for example, from the `app.bsky.graph.getFollows` Lexicon RPC endpoint — to build new use cases, and bootstrap with an existing user base. This, in turn, gets you to native ATProtocol concepts like [A Social Filesystem](https://overreacted.io/a-social-filesystem/).
ja: これは、atprotoアプリに対して行ったすべてのPOSTリクエストが保持され、同じ形式でストリーミングできることも意味します。これにより、開発者はバックエンドの実装について多くの決定を下す必要がなくなりました。これは、ATプロトコル上に構築された新しいアプリケーションが、既存のソーシャルグラフデータ（`app.bsky.graph.getFollows` Lexicon RPC エンドポイントで得られるようなもの）を活用して、新しいユースケースを構築し、既存のユーザーベースでブートストラップできることも意味します。これにより、[A Social Filesystem](https://overreacted.io/a-social-filesystem/)のようなネイティブATプロトコルの概念が得られます。

source: This appeal will be sent to <0>{sourceName}</0>.
ja: この申し立ては<0>{sourceName}</0>に送られます。

source: This appeal will be sent to Bluesky's moderation service.
ja: この異議申し立てはBlueskyのモデレーション・サービスに送られます。

source: This can be broken down as `at://DID/NSID/rkey` , or `at://repository/collection/record`. It has a corresponding CID of `bafyreidgbehqwweghrrddfu6jgj7lyr6fwhzgazhirnszdb5lvr7iynkiy`.
ja: これは`at://DID/NSID/rkey`または`at://repository/collection/record`に分解できます。対応するCIDは`bafyreidgbehqwweghrrddfu6jgj7lyr6fwhzgazhirnszdb5lvr7iynkiy`です。

source: This chat was disconnected
ja: このチャットは切断されました

source: This code is invalid. Resend to get a new code.
ja: このコードは無効です。再送信で新しいコードを取得してください。

source: This commits the document to the repo, then fires off a write into the event logs which are listening to the repo.
ja: これにより、ドキュメントがリポジトリにコミットされ、リポジトリをリッスンしているイベントログへの書き込みが開始されます。

source: This confirmation code is not valid. Please try again.
ja: この確認コードは無効です。もう一度やり直してください。

source: This constant is used in three places:
ja: この定数は次の3か所で使われます。

source: This content has been hidden by the moderators.
ja: このコンテンツはモデレーターによって非表示になっています。

source: This content has received a general warning from moderators.
ja: このコンテンツはモデレーターから一般的な警告を受けています。

source: This content is hosted by {0}. Do you want to enable external media?
ja: このコンテンツは{0}によってホストされています。外部メディアを有効にしますか？

source: This content is not available because one of the users involved has blocked the other.
ja: このコンテンツは関係するユーザーの一方が他方をブロックしているため、利用できません。

source: This content is not viewable without a Bluesky account.
ja: このコンテンツはBlueskyのアカウントがないと閲覧できません。

source: This conversation is with a deleted or a deactivated account. Press for options
ja: 削除あるいは無効化されたアカウントとの会話です。押すと選択肢が表示されます

source: This creates:
ja: これにより以下が作成されます。

source: This design pattern is strongly recommended for new app modalities.
ja: このデザインパターンは、新規アプリのモダリティに強く推奨されます。

source: This document complements the [Account Hosting](/specs/account) specification, which gives a high-level overview of account lifecycles. It breaks down the individual migration steps, both for an "easy" migration (when both PDS instances participate), and for account recovery scenarios. Note that these specific mechanisms are not a formal part of the protocol, and may evolve over time.
ja: この文書は[アカウントホスティング](/specs/account]仕様が与えるアカウントライフサイクル概要を補完します。両方のPDSが協力する簡単な移行と、アカウント復旧シナリオの双方における移行手順を詳細に示します。これらの具体的な仕組みはプロトコルの正式な一部ではなく、将来的に変更される可能性があることに注意してください。

source: This document complements the [Account Hosting](/specs/account) specification, which gives a high-level overview of account lifecycles. It summarizes the expected behaviors for a few common account lifecycle transitions, and what firehose events are expected in what order. Software is generally expected to be resilient to partial or incorrect event transmission.
ja: この文書は[アカウントホスティング](/specs/account)仕様が与えるアカウントライフサイクル概要を補完します。アカウントライフサイクルの移り変わりの幾つかにおける望ましい挙動や、どのfirehoseイベントがどんな順番で現れるべきかをまとめます。ソフトウェアは一般的に不完全なイベントや誤ったイベントの送信への耐性が期待されます。

source: This email is already associated with your account.
ja: このメールアドレスはすでにあなたのアカウントと関連付けられています。

source: This feature allows users to receive notifications for your new posts and replies. Who do you want to enable this for?
ja: この機能により、他のユーザーはあなたの新しい投稿と返信の通知を受け取ることができます。誰にこの機能を有効にしますか？

source: This feature is in beta. You can read more about repository exports in <0>this blogpost</0>.
ja: この機能はベータ版です。リポジトリのエクスポートの詳細については、<0>このブログ投稿</0>を参照してください。

source: This feature is not available while using an App Password. Please sign in with your main password.
ja: この機能はアプリパスワードでは利用できません。メインパスワードでサインインしてください。

source: This feature is not available while using an app password. Please sign in with your main password.
ja: この機能はアプリパスワードでは利用できません。メインパスワードでサインインしてください。

source: This feed is currently receiving high traffic and is temporarily unavailable. Please try again later.
ja: 現在このフィードにはアクセスが集中しており、一時的にご利用いただけません。時間をおいてもう一度お試しください。

source: This feed is empty! You may need to follow more users or tune your language settings.
ja: このフィードは空です！もっと多くのユーザーをフォローするか、言語の設定を調整する必要があるかもしれません。

source: This feed is empty.
ja: このフィードは空です。

source: This feed is no longer online. We are showing <0>Discover</0> instead.
ja: このフィードはもはやオンラインではありません。代わりに<0>Discover</0>を表示しています。

source: This generates TypeScript files in `./src/lexicons`. Now, you'll have these functions available to use in your code:
ja: これにより`./src/lexicons`にTypeScriptファイルが生成されます。これで、コードでこれらの関数が利用可能になります。

source: This gives you all the tools you need to continue building on AT Protocol. You can find more guides and tutorials in our [Guides](/guides) section, and more example apps in the [Cookbook](https://github.com/bluesky-social/cookbook/) repository. Happy building!
ja: さらに多くのガイドやチュートリアルは[Guides](/guides)セクションで、より多くのサンプルアプリは[Cookbook](https://github.com/bluesky-social/cookbook/)リポジトリで確認できます。ぜひ開発を楽しんでください。

source: This guide describes how to request permissions for your AT Proto application. [OAuth](/guides/auth) is used to authorize third-party applications to access users' social graphs, and is a prerequisite for the concepts described here.
ja: このガイドでは、ATプロトコルアプリケーションの権限リクエスト方法を説明します。[OAuth](/guides/auth)はサードパーティーアプリにユーザーのソーシャルグラフへのアクセス権を与えるために使用され、ここで説明する概念の前提条件です。

source: This guide describes how to request permissions for your Atproto application. [OAuth](/guides/auth) is used to authorize third-party applications to access users' social graphs, and is a prerequisite for the concepts described here.
ja: このガイドでは、atprotoアプリケーションの権限リクエスト方法を説明します。[OAuth](/guides/auth)はサードパーティーアプリにユーザーのソーシャルグラフへのアクセス権を与えるために使用され、ここで説明する概念の前提条件です。

source: This handle is reserved. Please try a different one.
ja: このハンドルは予約されています。他のものをお試しください。

source: This identity-addressing of data is an inversion of the web-based model of location-addressed data. In the traditional web, the location (or the server) is the primary object; in atproto, the user is the primary object.
ja: このデータのIDアドレス化は、ロケーションアドレッシングデータというウェブ的モデルの裏返しです。従来のウェブでは場所（またはサーバー）が主対象ですが、atprotoではユーザーが主対象です。

source: This information is private and not shared with other users.
ja: この情報はプライベートで他のユーザーと共有されません。

source: This is a fairly large amount of data (hundreds of GBs at the time of writing), and will be somewhat demanding in terms of resources.
ja: これはかなり大量のデータ（執筆時点で数百GB）であり、リソースの点でやや要求が厳しいものになります。

source: This is a fully usable Atmosphere integration, and many applications will use this as a starting point. Note that it produces a straightforward, readable "Authorize" flow. The URL of the requesting app is clearly visible, and the permissions dialog states that the app "wants to uniquely identify you," but nothing else.
ja: これは十分に実用的なAtmosphere連携で、多くのアプリが出発点として利用します。ここでは明快で読みやすい「Authorize」フローが提示されます。要求元アプリのURLが明確に表示され、権限ダイアログにはアプリが「wants to uniquely identify you（あなたを識別しようとしています）」とだけ示され、それ以外はありません。

source: This is a revision of our original Statusphere tutorial.
ja: これは元のStatusphereチュートリアルを改訂したものです。

source: This is all at the discretion of app developers and Lexicon designers. We provide a model for using different Lexicons side by side, and for each Lexicon to define its own permission sets and presentation.
ja: これらはすべてアプリ開発者とLexicon設計者の裁量に委ねられています。私たちは、異なるLexiconを並行して利用し、各Lexiconが独自の権限セットと表示を定義するためのモデルを提供しています。

source: This is an empty state
ja: これは空の状態です

source: This is an important optimization to make, because it ensures that the user sees their own changes while using your app. When the event eventually arrives from the firehose, we just discard it since we already have it saved locally.
ja: これは、ユーザーがアプリの使用中に自分の変更を確認できるようにするため、重要な最適化です。最終的にイベントがファイアホースから到着すると、すでにローカルに保存されているため、それを破棄します。

source: This is because services such as the App View do not have transactional writes from a user's PDS. Therefore the views that they calculate are eventually consistent. In other words, a user may have created a record on their PDS that is not yet reflected in the API responses provided by the App View.
ja: これは、AppViewなどのサービスにユーザーのPDSからのトランザクション書き込みがないためです。したがって、計算されたビューは結果整合性を持ちます。言い換えれば、ユーザーはAppViewによって提供されるAPI応答にまだ反映されていないレコードをPDS上に作成していることがあります。

source: This is better for scaling, but without SQL it's becoming harder to build our queries. It turns out that SQL databases have a lot of useful features, like JOIN and aggregation queries. In fact, our NoSQL database is really just a key-value store. Writing features is becoming a pain!
ja: これは拡張には適していますが、SQLがないとクエリの構築が難しくなります。SQLデータベースには、JOINや集計クエリなど、多くの便利な機能があることがわかりました。実際、NoSQLデータベースは単なるキーバリューストアです。機能の作成は面倒になってしまいます。

source: This is how every app in the Atmosphere works, including the [Bluesky social app](https://bsky.app).
ja: [Blueskyソーシャルアプリ](https://bsky.app)を含む、Atmosphereのすべてのアプリはこのように動作します。

source: This is how individual records are uniquely identified and stored within AT data repositories.
ja: これが、個々のレコードがATデータリポジトリ内で一意に識別され、保存される方法です。

source: This is not a valid link
ja: 有効なリンクではありません

source: This is pretty good, but we're building a social network with hundreds of millions of users; even this model hits limits. The problem is that our SQL database is “[strongly consistent](https://en.wikipedia.org/wiki/Strong_consistency)” which means the state is kept uniformly in sync across the system. Maintaining strong consistency incurs a performance cost which becomes our bottleneck.
ja: これはかなり良いですが、何億人ものユーザーを抱えるソーシャルネットワークを構築しているため、このモデルでも限界に達します。問題は、SQLデータベースが[強い一貫性](https://en.wikipedia.org/wiki/Strong_consistency)を持つことです。つまり、状態はシステム全体で均一に同期されています。強い一貫性を維持するとパフォーマンス コストが発生し、それがボトルネックになります。

source: This is the same kind of SSO flow that Google or GitHub uses. The user will be asked for their password, then asked to confirm the session with your application.
ja: これは、GoogleやGitHubが使用するのに似たSSOフローです。ユーザーはパスワードを求められ、次にアプリケーションとのセッションを確認するように求められます。

source: This kicks off both your connection to `tap` (your feed input) and your XRPC server (your feed output). It also provides some logging to help you test your feed generator.
ja: これで`tap`への接続（フィード入力）とXRPCサーバー（フィード出力）の両方が開始されます。フィードジェネレーターのテストに役立つログ出力も備えています。

source: This label was applied by the author.
ja: 投稿者によって適用されたラベルです。

source: This label was applied by you.
ja: あなたによって適用されたラベルです。

source: This labeler hasn't declared what labels it publishes, and may not be active.
ja: このラベラーはどのようなラベルを発行しているか宣言しておらず、活動していない可能性もあります。

source: This layout is reflected in the [AT URIs](/specs/at-uri-scheme):
ja: このレイアウトは、[AT URI](/specs/at-uri-scheme)に反映されています。

source: This link is taking you to the following website:
ja: このリンクは次のウェブサイトへリンクしています：

source: This list is empty.
ja: このリストは空です。

source: This list – created by <0>{0}</0> – contains possible violations of Bluesky's community guidelines in its name or description.
ja: <0>{0}</0>が作成したこのリストは名前または説明がBlueskyのコミュニティガイドラインに違反している可能性があります。

source: This list – created by you – contains possible violations of Bluesky's community guidelines in its name or description.
ja: あなたが作成したこのリストは名前または説明がBlueskyのコミュニティガイドラインに違反している可能性があります。

source: This moderation service is unavailable. See below for more details. If this issue persists, contact us.
ja: このモデレーションのサービスはご利用できません。詳細は以下をご覧ください。この問題が解決しない場合は、サポートへお問い合わせください。

source: This new web is significantly easier to participate in — you don't need to know how to run a server or have a static IP address in order to publish content on the web. You can simply create an account. Perhaps most importantly, the modern web is capable of supporting richer and more dynamic content and interactions: real time conversations, global views of everything happening in a network, and algorithms that direct users' attention through these vast networks of data.
ja: この新しいウェブは参加がはるかに容易です。ウェブ上でコンテンツを公開するためにサーバーの運用方法や固定IPアドレスの取り方を知る必要はありません。アカウントを作成するだけでよいのです。そして最も重要なのは、現代のウェブがより豊かで動的なコンテンツと相互作用を支えられることです。リアルタイムの会話、ネットワーク内で起きるすべてのことのグローバルなビュー、そして膨大なデータのネットワークを通じてユーザーの注意を注意を惹くアルゴリズムなどです。

source: This ownership is reflected in the schema language for the atproto network where the notion of ownership is baked into the IDs of schemas. The owner of those schemas is free to iterate and evolve the data model for the application. Similarly, application owners are free to build their backends in whichever way they see fit. There is a boundary to the “weirdness” of the atproto network. Once identities and data cross that threshold, it is the application's decision how to index it and present it to the user.
ja: この所有権は、atprotoネットワークのスキーマ言語に反映されており、スキーマIDに所有権の概念が組み込まれています。スキーマの所有者は、アプリケーションのデータモデルを自由に反復・進化させられます。同様に、アプリケーションの所有者は自分に適した方法でバックエンドを構築できます。atprotoネットワークには「変わったこと」の境界が存在します。IDとデータがその境界を越えた後は、どのようにインデックスし、ユーザーに提示するかはアプリケーションの判断になります。

source: This post claims to have been created on <0>{0}</0>, but was first seen by Bluesky on <1>{1}</1>.
ja: <0>{0}</0>に投稿されたと表示されていますが、Blueskyに初めて登場したのは<1>{1}</1>です。

source: This post has an unknown type of threadgate on it. Your app may be out of date.
ja: 投稿に対する返信制限のタイプが不明です。アプリが古いかもしれません。

source: This post is only visible to logged-in users.
ja: この投稿はログイン中のユーザーにのみ表示されます。

source: This post was deleted by its author
ja: この投稿は投稿者によって削除されました

source: This post will be hidden from feeds and threads. This cannot be undone.
ja: この投稿はフィードとスレッドから非表示になります。元に戻すことはできません。

source: This post's author has disabled quote posts.
ja: この投稿の投稿者は引用投稿を無効にしています。

source: This profile is only visible to logged-in users. It won't be visible to people who aren't signed in.
ja: この投稿はサインインしているユーザーにのみ表示されます。サインインしていないユーザーには表示されません。
